{"season":7,"name":"Field Trip","year":"2011","rated":"TV-14","released":null,"episode":5,"runtime":"21 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (created by), Carter Bays (creator), Craig Thomas (created by), Craig Thomas (creator), Jamie Rhonheimer, Craig Gerard (story editor), Matthew Zinman (story editor), Dan Gregor (story editor), Doug Mand (story editor)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"Despite their therapy going well, Kevin announces to Robin that he is quitting being her therapist since he is moving to Alaska. Robin soon learns that that story is a lie. He quit being her therapist since he was attracted to her. Learning that information, she admits her feelings for him in a roundabout way, and they eventually begin to date. They have to decide whether they can get over the issues that they spoke of in therapy, and get over the unethical nature of their relationship, especially as everyone reminds them of how unethical it is. Marshall, now in his dream job of working for famed environmental lawyer Garrison Cootes, may now believe that the job is not as much of a dream as he imagined it would be. Cootes seems to be letting major polluters off the hook by accepting less than sizable settlements. Cootes and the rest of the staff seem elated by these meager settlements. When Marshall learns the reason why, he has to decide what to do with the information. Ted is taking his Introduction to Architecture class on a field trip to the GNB headquarters building site in the hopes of inspiring them to choose architecture as their career. The field trip in and of itself doesn't end up being what he had hoped - although he and Barney end up using it for a different, albeit important purpose altogether - but an unwitting act by Ted may still get him to his end goal. And Barney, upon learning that Nora hates Ewoks, comes to an important realization about her, which may be a deal breaker for their relationship.","languages":"English, German","country":"USA","awards":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUyOTM4OTc5OF5BMl5BanBnXkFtZTcwMzYxODk4Ng@@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"7.6/10"}],"metascore":"N/A","rating":"7.6","votes":"1682","imdbid":"tt2071800","seriesid":"tt0460649","type":"episode","response":"True"}