{"season":4,"name":"The Children","year":"2014","rated":"R","released":null,"episode":10,"runtime":"65 min","genres":"Adventure, Drama, Fantasy","director":"Alex Graves","writer":"George R.R. Martin (based on \"A Song of Ice and Fire\" by), David Benioff (created by), D.B. Weiss (created by), David Benioff (written for television by), D.B. Weiss (written for television by)","actors":"Peter Dinklage, Nikolaj Coster-Waldau, Lena Headey, Emilia Clarke","plot":"Jon Snow arrives at Mance's camp and both of them come up with suggested peaceful solutions to the conflict. However Stannis turns up with a vast army which defeats the Wildlings. Jon acknowledges him but requests fair play for Mance who treated him well when he was his prisoner. At King's Landing Cersei is threatening to go public about herself and Jaime if Tywin insists on marrying her to Loras but they are overtaken by events when Tyrion escapes, helped by Jaime and Lord Varys, and kills Tywin and the faithless Shae whom he finds in his father's bed. Hidden in a large crate he is lifted aboard a ship to leave King's Landing with Varys. Daenerys is seeing supplicants, one of whom presents her with the corpse of his child, killed by her escaped dragon Drogon. Aware that her dragons are now a menace she locks up the other two. Bran and his friends reach the tree and the three-eyed raven but are attacked by Wights, who kill Jojen. The remaining party is led to safety in a cave by a mystical little girl who claims she is one of an ancient race the Children. Brienne catches up with Arya and the Hound and mortally wounds the latter in a sword fight. Rather than give in to his pleas to kill him quickly Arya leaves him to die and heads to a seaport where she hands a ship's captain the iron coin given her by Jaqen and, after uttering 'Valar Morghulis' is given passage.","languages":"English","country":"USA","awards":"1 win.","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MDAxNDg5OF5BMl5BanBnXkFtZTgwOTQ1NzEwMjE@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"9.6/10"}],"metascore":"N/A","rating":"9.6","votes":"23587","imdbid":"tt3060860","seriesid":"tt0944947","type":"episode","response":"True"}