{"season":5,"name":"The House of Black and White","year":"2015","rated":"TV-MA","released":null,"episode":2,"runtime":"56 min","genres":"Adventure, Drama, Fantasy","director":"Michael Slovis","writer":"George R.R. Martin (based on \"A Song of Ice and Fire\" by), David Benioff (created by), D.B. Weiss (created by), David Benioff (written for television by), D.B. Weiss (written for television by)","actors":"Peter Dinklage, Nikolaj Coster-Waldau, Lena Headey, Emilia Clarke","plot":"Arya Stark sails to Braavos and arrives at the House of Black and White to seek out Jaqen H'ghar; however she is not welcomed to enter in the house and she throws her coin away into the sea. Brienne and Podrick are eating in a tavern and she contacts Sansa and Little Finger, but Sansa refuses to follow Brienne. The men that are escorting Little Finger and Sansa unsuccessfully hunt Brienne and Podrick down on the road. Cersei shows to Jaime that their daughter Myrcella is in danger and Jaime seeks out Bronn and makes an offer for him to travel with him to Dome. In Meereen, the Son of Harpy is captured and Daenerys has a meeting with her leaders to decide his fate. Barristan advises her to give a fair trial to the man; however Mossador disrespects her order and kills the Son of Harpy. Daenerys sentences him to death and there is a riot in Meereen. Jon Snow is invited by Stannis Baratheon to serve him; in return, he would give the North to Jon and he would be Jon Stark, Lord of Winterfell. But Jon Snow turns the invitation down and he is chosen to be the new Commander of the Night Watch. Arya is finally invited to come to the House of Black and White by Jaqen H'ghar.","languages":"N/A","country":"N/A","awards":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAzNzMyMTM1MV5BMl5BanBnXkFtZTgwMjk4NDY0NTE@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"8.6/10"}],"metascore":"N/A","rating":"8.6","votes":"12225","imdbid":"tt3846626","seriesid":"tt0944947","type":"episode","response":"True"}