{"season":17,"name":"Milhouse of Sand and Fog","year":"2005","rated":"TV-PG","released":null,"episode":3,"runtime":"30 min","genres":"Animation, Comedy","director":"Steven Dean Moore","writer":"Matt Groening (created by), James L. Brooks (developed by), Matt Groening (developed by), Sam Simon (developed by), Patric M. Verrone","actors":"Dan Castellaneta, Julie Kavner, Nancy Cartwright, Yeardley Smith","plot":"When Maggie is showing signs of being ill, the family goes to \"the more boisterous house of worship\" in town to find Dr. Hibbert, who tells them that Maggie is developing the chicken pox. After Maggie develops the disease, Marge tries to keep Homer away from her, since he has never had them. After Flanders expresses an interest in getting his kids infected, Homer and Marge open up the house for a \"pox party.\" Milhouse's divorced parents are both at the party and after some \"Margerita's\" are consumed, find themselves getting back together. Meanwhile, Homer has developed the chicken pox and Marge tries to keep him from scratching. Milhouse likes the idea of his parents getting back together, but then begins to hate it when he has trouble getting either of them to pay any attention to him. After seeing an episode of The O.C. Milhouse and Bart come up with a plan to get his parent's separated again, they plant one of Marge's bras in Kirk & Luann's bed. They don't succeed in breaking them up; rather they break up Homer and Marge. Even after Bart confesses his guilt, Marge doesn't want anything to do with Homer, since he obviously doesn't trust him anymore. Bart concocts an outrageous scheme to get them back together, but it goes terribly wrong and both he and Homer find themselves in the river heading toward the falls needing to place their trust in Marge.","languages":"English","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTk0MTAzMzgxOV5BMl5BanBnXkFtZTgwOTM3Mjg4MzE@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"7.0/10"}],"metascore":"N/A","rating":"7.0","votes":"507","imdbid":"tt0757020","seriesid":"tt0096697","type":"episode","response":"True"}