{"season":7,"name":"Tailgate","year":"2012","rated":"TV-14","released":null,"episode":13,"runtime":"22 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (creator), Craig Thomas (creator), Carter Bays, Craig Thomas, Craig Gerard (story editor), Matthew Zinman (story editor), Dan Gregor (story editor), Doug Mand (story editor)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"On January 1, 2012, Marshall heads back to St. Cloud, Minnesota to spend the day alone with his father to keep on with a tradition between the two: hold a tailgate party while watching the Vikings/Bears game. Marshall resists any change to what he sees as that tradition, which may not be easy due to the activity happening around him. Regardless, Marshall has come to tell his father of the exploits of his and Lily's and their friends' New Year's Eve celebrations. Marshall and Lily discussed whether or not they should tell Lily's father about her pregnancy. Lily had up to this point resisted the idea of telling him if only not wanting to be disappointed by him yet again. Kevin tried to convince Robin that she should try and get a job working in front of the camera once again. Their New Year's Eve celebration alone together took an unexpected turn when Robin got a telephone call from an inebriated on-air Sandy Rivers, who needed her help with his New Year's Eve live national broadcast. Robin's help extended a little further than she expected. And Ted and Barney had troubles trying to get into crowded MacLaren's due to bouncer Doug's strict entrance policy. As such, Ted and Barney, with help from a then dateless for the evening Kevin, decided to open Puzzles, their own bar in Ted and Robin's apartment.","languages":"English","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMjAwMjgwMjY4MV5BMl5BanBnXkFtZTcwMDYzODAyNw@@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"7.7/10"}],"metascore":"N/A","rating":"7.7","votes":"1575","imdbid":"tt2157459","seriesid":"tt0460649","type":"episode","response":"True"}