{"season":5,"name":"Double Date","year":"2009","rated":"TV-14","released":null,"episode":2,"runtime":"30 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (created by), Carter Bays (creator), Craig Thomas (created by), Craig Thomas (creator), Matt Kuhn, Robia Rashid (executive story editor), Matt Kuhn (story editor)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"In 2009, Ted goes on a blind date with a woman named Jen. It isn't until they're at the restaurant about ready to order that they both come to the realization that they are reliving the same blind date they had with each other in 2002. This date is going about as well as that first one did, but as they come to the conclusion that their dating lives have pretty much stalled in that seven years, they decide to relive the remainder of that date from seven years ago to learn why they make such bad first impressions. But as they learn what they did wrong, will those turn into rights for the two of them, or will wrongs always be wrongs? Meanwhile, Barney comes up with a plan to hijack Marshall without either Robin or Lily knowing what's going on. The reason is that Barney has come to the conclusion that Marshall's life is controlled by Lily and in Barney's mind he needs to get out and have some guy's fun. So Barney takes him to a strip club. There, Marshall opens up about how he fantasizes about other women. But Marshall and Barney ultimately have to tell Lily and Robin where they went since something much more important happens at the strip club than the need to hide their whereabouts from their significant others.","languages":"English","country":"USA","awards":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MTE5OTkxN15BMl5BanBnXkFtZTcwNzQzODY4Mg@@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"8.2/10"}],"metascore":"N/A","rating":"8.2","votes":"1723","imdbid":"tt1510422","seriesid":"tt0460649","type":"episode","response":"True"}