{"season":4,"name":"Itchy & Scratchy: The Movie","year":"1992","rated":"TV-14","released":null,"episode":6,"runtime":"30 min","genres":"Animation, Comedy","director":"Rich Moore","writer":"Matt Groening (created by), James L. Brooks (developed by), Matt Groening (developed by), Sam Simon (developed by), John Swartzwelder","actors":"Dan Castellaneta, Julie Kavner, Nancy Cartwright, Yeardley Smith","plot":"During Parent-Teacher Night at school, Ms. Krabappel tells Marge she is troubled by Bart's increasingly demonic behavior. She urges Homer and Marge to be more strict with Bart when it comes to discipline. They try out Krabappel's advice when Bart damages Grampa's dentures in his latest household antics and ground him from supper. Bart realizes he needs to change, but when Homer comes into his room with pizza, he decides he can get away with anything. However, Bart eventually presses his luck. One day when he is asked to watch Maggie, she wanders off and knocks the car in gear, crashing it into Springfield Prison (resulting in a massive jailbreak). This time, Homer decides he needs to be severe with Bart: He can never watch the soon-to-open \"The Itchy and Scratchy Movie,\" a movie that has seen a massive advertising blitz in Springfield. Bart forlornly watches a long line for the movie extend past his house, and as the months pass, he finally realizes he needs to change. Homer tells him that through proper discipline, anything is possible - even Krabappel's earlier remark that Bart could one day become Chief Justice of the Supreme Court. In the closing tag (set 40 years into the future), Homer and Bart watch \"The Itchy and Scratchy Movie\" at an oldies theater.","languages":"English","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTk0MTAzMzgxOV5BMl5BanBnXkFtZTgwOTM3Mjg4MzE@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"8.2/10"}],"metascore":"N/A","rating":"8.2","votes":"1221","imdbid":"tt0701139","seriesid":"tt0096697","type":"episode","response":"True"}