{"season":4,"name":"The Stinsons","year":"2009","rated":"TV-14","released":null,"episode":15,"runtime":"30 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (created by), Carter Bays (creator), Craig Thomas (created by), Craig Thomas (creator), Carter Bays, Craig Thomas, Joe Kelly (executive story editor), Robia Rashid (story)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"Barney's recent behavior makes the gang believe he is hiding a girlfriend from them. When they follow him to what they think is a rendezvous with her, they end up at the home of Loretta Stinson, Barney's mother, where they meet Barney's wife and son, Betty and Tyler. In reality, \"Betty\" and \"Tyler\" are both actors who Barney hired. Margaret has been playing the role of Betty for seven years. To grant Loretta her dying wish of her sons being with someone they loved - Loretta who was on her deathbed at the time (and who obviously survived that ordeal) - Barney hired Margaret to play his fiancée to fulfill that wish. When Margaret, going off script, stated that she was pregnant, Barney eventually had to produce a son Tyler, who in his current incarnation is played by Grant. The already convoluted plot is made even more so when everyone catches Ted making out with \"Betty\". Ted has to use some of the improvisation skills he learned from actress Margaret to get them all out of this mess. But will Ted's acting skills be able to do the trick, and will the others be able to follow his lead? Meanwhile, while watching Barney deal with his mother, Marshall learns something about Lily's relationship to his mother. And Robin has a \"moment\" with Grant, or so he hopes.","languages":"English, German","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTg2MTYyODIyOV5BMl5BanBnXkFtZTcwNzEyOTAzMg@@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"8.3/10"}],"metascore":"N/A","rating":"8.3","votes":"1511","imdbid":"tt1256176","seriesid":"tt0460649","type":"episode","response":"True"}