{"season":5,"name":"Homer Goes to College","year":"1993","rated":"TV-14","released":null,"episode":3,"runtime":"30 min","genres":"Animation, Comedy","director":"Jim Reardon","writer":"Matt Groening (created by), James L. Brooks (developed by), Matt Groening (developed by), Sam Simon (developed by), Conan O'Brien, Bill Canterbury (staff writer), David X. Cohen (staff writer)","actors":"Dan Castellaneta, Julie Kavner, Nancy Cartwright, Yeardley Smith","plot":"Naptime at the Springfield Nuclear Power Plant is rudely interrupted by the Nuclear Regulatory Commission, which is conducting a surprise inspection and employee audit. Homer's skills are tested and not only is he found to be incompetent, he causes a nuclear meltdown! The NRC inspectors demand that Homer (who is found to lack proper certification) either take college courses to obtain the necessary credentials or else Mr. Burns will face criminal charges. Burns gets Homer enrolled at Springfield University, where he acts like an immature adolescent (both in class and around campus) rather than someone needing to study for a college degree. When he continues to act like a know-it-all in physics class, the professor has enough and asks him to demonstrate a proton accelerator; Homer winds up causing another meltdown. Homer is asked to hire a tutor, and does: nerds Benjamin, Gary and Doug. Instead of applying himself, Homer sees the three nerds have no social life and decides to teach them how to party. He masterminds a practical joke with rival Springfield A&M University's college mascot, Sir Oinks-a-Lot, but things backfire and the nerds are expelled. Homer feels bad and allows them to move into his house, but the nerds quickly disrupt the family routine. Marge demands that the nerds need to go, so Homer decides to get them re-enrolled by having the nerds save the dean's life by pushing him out of the way of Homer's car. However, the plan fails and the dean will now need hip replacement surgery. At the hospital, Homer admits his recent schemes, and the dean (who for some reason is not upset at all) allows the nerds to re-enroll. With the final exam fast approaching, Benjamin, Gary and Doug have no choice but to force Homer to cram. However, Homer still fails his exam ... or does he? Homer tries to get the nerds to hack into the college computer mainframe and change his grade, but Marge puts a stop to it and orders him to re-take the course ... alas, it only gives Homer more time to party!","languages":"English","country":"USA","awards":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU4ZmM4YzYtOWFlMC00ZDYxLWFhZTYtOGU0MDVmYzNlZmM0XkEyXkFqcGdeQXVyNjcwMzEzMTU@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"8.6/10"}],"metascore":"N/A","rating":"8.6","votes":"1539","imdbid":"tt0773645","seriesid":"tt0096697","type":"episode","response":"True"}