{"season":2,"name":"Bart vs. Thanksgiving","year":"1990","rated":"TV-14","released":null,"episode":7,"runtime":"23 min","genres":"Animation, Comedy","director":"David Silverman","writer":"Matt Groening (created by), James L. Brooks (developed by), Matt Groening (developed by), Sam Simon (developed by), George Meyer","actors":"Dan Castellaneta, Julie Kavner, Nancy Cartwright, Yeardley Smith","plot":"Grampa, Mother Bouvier, Patty and Selma join the Simpsons on Thanksgiving Day. Just before the turkey is brought in, Lisa shows off a meticulously crafted cornucopia paying homage to women in history. When Bart brings in the turkey and begins to set it on the table, he complains Lisa's centerpiece is in the way. A fight ensues, and the centerpiece lands in the fireplace, where it quickly burns up. Lisa runs to her room in tears, and Bart is ordered to go to his room and not come out until he apologizes. When Bart continues to refuse to apologize, he decides to run away. Santa's Little Helper joins him (after he is kicked out for trying to get a nibble of Homer's turkey). After a run-in with a pack of killer dogs at Mr. Burns' mansion, Bart donates some plasma for $12. He passes out, and a pair of bums take him to a homeless shelter for Thanksgiving dinner, the topic of Kent Brockman's news report. Brockman interviews Bart, who still refuses to apologize. Eventually, Bart sees that the bums could use the money he earned donating blood and gives it to him. He then realizes that he has plenty to be thankful for, and he and SLH trudge home. Upon arrival, Bart envisions a warm welcome home that quickly grows into his family mocking him and blaming him \"for everything.\" Bart continues to sort out his feelings when he overhears Lisa crying and conceding defeat. Eventually, Bart apologizes to Lisa, she accepts and the family gets to enjoy Thanksgiving together.","languages":"English","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BNDY2ODU2MTA1NV5BMl5BanBnXkFtZTgwNjM3NTQ2MjE@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"7.7/10"}],"metascore":"N/A","rating":"7.7","votes":"1211","imdbid":"tt0701062","seriesid":"tt0096697","type":"episode","response":"True"}