{"season":6,"name":"Book of the Stranger","year":"2016","rated":"TV-MA","released":null,"episode":4,"runtime":"59 min","genres":"Adventure, Drama, Fantasy","director":"Daniel Sackheim","writer":"George R.R. Martin (based on \"A Song of Ice and Fire\" by), David Benioff (created by), D.B. Weiss (created by), David Benioff (written for television by), D.B. Weiss (written for television by)","actors":"Peter Dinklage, Nikolaj Coster-Waldau, Lena Headey, Emilia Clarke","plot":"Sansa arrives at Black Castle with Brienne and Podrick and reunites to Jon Snow, who has resigned from the Night's Watch after the deception of the betrayal of his brothers. Sansa tries to convince him to attack and retake Winterfell while Brienne meets Davos and Melisandre and warns that she killed Stannis and she does not forget or forgive the assassination of Renly through black magic. Littlefinger returns to Runestone and is welcomed by his nephew Robin and convinces him to send his army to protect Sansa at Castle Black. In Meereen, Tyrion negotiates a truce and the end of the support to the Sons of Harpy with the masters of Slaver's Bay. Jorah and Daario arrive at Vaes Dothrak and they meet Daenerys that explains a plan to them. Margaery meets the High Sparrow and he tells how he learned the truth. Tommen tells to Cersei that Margaery will be exposed to the people soon, and Cersei plots a scheme with Olenna to destroy the High Sparrow. Theon returns to the Iron Island and after a cold reception of Yara, he tells that he wants to support her. Ramsey stabs Osha with a knife killing her in Winterfell. Jon Snow receives a letter from Ramsey with insults and threatening him. Daenerys is brought to the khals in a temple and the set in motion her evil plan.","languages":"English","country":"USA","awards":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNDc1NjkyOV5BMl5BanBnXkFtZTgwNDkwMzg4ODE@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"9.2/10"}],"metascore":"N/A","rating":"9.2","votes":"20508","imdbid":"tt4283016","seriesid":"tt0944947","type":"episode","response":"True"}