{"season":5,"name":"The Window","year":"2009","rated":"TV-14","released":null,"episode":10,"runtime":"30 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (created by), Carter Bays (creator), Craig Thomas (created by), Craig Thomas (creator), Joe Kelly, Robia Rashid (executive story editor), Matt Kuhn (story editor)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"Ted has always thought that Maggie Wilks, a woman he and Marshall and Lily knew in college, is the perfect woman. He's wanted to date her ever since she moved to New York, but she's always been in a relationship. Even between relationships, it's been a matter of hours before she was with another man in a long term relationship. So when Ted finds out, with the help of Maggie's cooperative neighbor, that Maggie is once again single, Ted rushes over to her apartment before another man swoops in. He gets there in time. As Ted forgot that he has a class to teach for the time that he and Maggie are supposed to go on their first date, he asks Marshall and Lily to keep her away from any men until he returns. That plan goes slightly awry when Marshall, reading through an old letter he found that he wrote to his 30 year old self when he was 15, hits a sudden and early mid-life crisis, to which he and by association Lily have to attend. They leave Maggie in Robin's care. When Robin has to attend to another crisis in helping Ted, she leaves Maggie with Ted's worst nightmare: Barney. Will Barney respect Ted more than Maggie's babiliciousness? Meanwhile, the discussion in Ted's class that evening is a little different than in a standard architecture class.","languages":"English","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTU4OTc0MjExMl5BMl5BanBnXkFtZTgwNDE5MDMyMjE@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"8.1/10"}],"metascore":"N/A","rating":"8.1","votes":"1422","imdbid":"tt1553522","seriesid":"tt0460649","type":"episode","response":"True"}