{"season":6,"name":"Desperation Day","year":"2011","rated":"TV-14","released":null,"episode":16,"runtime":"30 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (created by), Carter Bays (creator), Craig Thomas (created by), Craig Thomas (creator), Tami Sagher, Matt Kuhn (executive story editor)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"It's approaching Valentine's Day 2011, and romance is not looking good for most of the gang. Robin and Barney have a laser tag date as friends on the actual day. Robin, single and proud of it, is spending the day before Valentine's Day with some single girlfriends in protest of the Hallmark day. Barney has renamed the 13th Desperation Day for all the single, desperate women who feel the need to hook-up with anyone by the end of the day so as not to be alone on the 14th. In his protest against this desperation, he vows to be home by midnight alone so that he say he doesn't have a date on Valentine's. Even Lily and Marshall are going to be apart on Valentine's as Marshall is still in Minnesota helping his mother after the passing of his father. Lily decides she needs to be with Marshall so makes an impromptu trip to Minnesota to be with her husband. What Lily sees at the Eriksen household is not quite what she expects. And Ted and Zoey have decided to take their relationship at a glacier's pace to give Zoey time to get over being divorced. But when their relationship goes from zero to sixty at the flick of a switch (really, at the sight of an overnight bag), Ted needs to decide at what speed he wants to go with Zoey if at all.","languages":"English","country":"USA","awards":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjIwNzc3NzY0NV5BMl5BanBnXkFtZTgwODM3MDMyMjE@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"8.1/10"}],"metascore":"N/A","rating":"8.1","votes":"1565","imdbid":"tt1795958","seriesid":"tt0460649","type":"episode","response":"True"}