{"season":4,"name":"The Front Porch","year":"2009","rated":"TV-14","released":null,"episode":17,"runtime":"30 min","genres":"Comedy, Romance","director":"Rob Greenberg","writer":"Carter Bays (created by), Carter Bays (creator), Craig Thomas (created by), Craig Thomas (creator), Chris Harris, Joe Kelly (executive story editor), Robia Rashid (story)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"The gang admit to Robin that they have never watched her on \"Come On, Wake Up New York\". So they agree that they will all go over to Marshall and Lily's on Friday, get dressed in their pajamas, and watch the show together. Marshall and Barney have polar opposite views on what constitutes appropriate bedtime attire. By the end of the night, one will have converted the other. Meanwhile, Ted's newest relationship with his old girlfriend Karen - who Marshall and Lily in particular hate - has just ended when Karen found one of Robin's earrings in Ted's bed, despite Ted vowing to her that he knows nothing about how it got there. When Ted finds the other earring in Marshall and Lily's bedroom, Lily confesses that she is the one who placed the earring in Ted's bed, thus orchestrating the break-up with Karen. Ted's anger with Lily increases when Lily admits that she has orchestrated more than one of his break-ups, she doing so whenever the girlfriend in question didn't meet what Lily calls her front porch test. Although she didn't officially break them up, Lily admits that she underhandedly made Ted and Robin critically evaluate their relationship which led to the break-up. Will Ted and Lily's friendship be able to withstand what he sees as this betrayal, especially concerning the break-up with Robin?","languages":"English, Hawaiian","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMjQwMjY4NTg1MV5BMl5BanBnXkFtZTgwNjU4MDMyMjE@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"8.4/10"}],"metascore":"N/A","rating":"8.4","votes":"1457","imdbid":"tt1256178","seriesid":"tt0460649","type":"episode","response":"True"}