{"season":8,"name":"The Final Page: Part One","year":"2012","rated":"TV-14","released":null,"episode":11,"runtime":"21 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (creator), Craig Thomas (creator), Dan Gregor, Doug Mand, Craig Gerard (executive story editor), Matthew Zinman (executive story editor), Dan Gregor (executive story editor), Doug Mand (executive story editor)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"Each of the friends somewhat admit that they have who they consider a \"pit guy\": someone who, if they had the power, would throw into a pit in their basement to banish forever, much like in The Silence of the Lambs (1991). For Ted, that person is his ex-architecture professor, Professor Vinick, who told Ted at the time that he had no talent and would never become an architect. Now that the GNB headquarters is about to open, Ted decides to invite Professor Vinick to the opening ceremonies to show him wrong. Professor Vinick's response makes Ted hold onto that grudge even harder. For Robin, that person is her co-worker, Patrice, who is now dating Barney. Robin will not however admit that Patrice is her pit guy because she still loves Barney herself. Robin has a chance to throw Patrice into her make believe pit when Robin has to fire a co-worker of her choice. For Lily and Marshall, that person is Daryl LaCorte, a colleague from Wesleyan who saw himself as their best friend after one game of hacky sack during their freshman year, although they tried at every turn to avoid him ever since. He still connects with them through social media. Lily and Marshall unwittingly learn of Daryl's whereabouts and his current plans for them. The one person who can't admit to having a pit guy is Barney, who, through a jinx that can only be removed by Ted, Robin, Marshall or Lily, but each who refuses to remove that jinx, is not allowed to speak or else face a dire consequence.","languages":"English","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTc1MjQ1MzExNF5BMl5BanBnXkFtZTcwMTk2OTM4OA@@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"8.6/10"}],"metascore":"N/A","rating":"8.6","votes":"1937","imdbid":"tt2556002","seriesid":"tt0460649","type":"episode","response":"True"}