{"season":8,"name":"The Stamp Tramp","year":"2012","rated":"TV-14","released":null,"episode":7,"runtime":"22 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (creator), Craig Thomas (creator), Tami Sagher, Craig Gerard (executive story editor), Matthew Zinman (executive story editor), Daniel Gregor (executive story editor), Doug Mand (executive story editor)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"Marshall runs into his law school buddy Brad, who now seems to be down and out, and a bit of a deadbeat. Since he was a friend, Marshall can't help but try to help him by getting him at least a job interview at his law firm, Honeywell & Cootes. Lily and his friends don't think it's such a good idea as nice guy Marshall is already seen as being a bit of a \"stamp tramp\" - a person who provides his stamp of approval on anything and everything, which over time renders that approval meaningless - and this could prove to hurt Marshall, especially if Brad is indeed a deadbeat, and as Honeywell, who would be conducting the interview, is already hard enough on Marshall. Marshall's stamp of approval of Brad has a slightly different effect than he imagined. In the discussion of stamp tramps, the gang believes Ted is a \"piggyback stamper\" - someone who believes his stamp of approval is his own idea, but only really approves something somebody else has already approved. Ted goes on a long quest for something on which he's placed his original stamp of approval. Meanwhile, Barney feels he has to abandon his regular strip club, the Lusty Leopard, since Quinn has gone back to working there. He gets an unexpected person to act as his agent for his lucrative strip club patronage.","languages":"English, French, Spanish","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTQwNzQ3MjAzMl5BMl5BanBnXkFtZTcwMzM5NzQ3OA@@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"7.4/10"}],"metascore":"N/A","rating":"7.4","votes":"1352","imdbid":"tt2460620","seriesid":"tt0460649","type":"episode","response":"True"}