{"season":7,"name":"The Best Man","year":"2011","rated":"TV-14","released":null,"episode":1,"runtime":"22 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (created by), Carter Bays (creator), Craig Thomas (created by), Craig Thomas (creator), Carter Bays, Craig Thomas, Craig Gerard (story editor), Matthew Zinman (story editor), Dan Gregor (story editor), Doug Mand (story editor)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"It's moments before Barney's wedding. He's got the jitters over whether he picked the right woman for his bride, and as a result whether the wedding will be a disaster. Ted and Barney reminisce about Ted's friend Punchy's recent wedding, which they declare was the worst wedding ever. There were several possible lead ups to the disaster of Punchy's wedding. One possible cause might have been Ted feeling insecure both about his non-married status compared to all his high school friends in attendance, and them waiting for the screw-up that was supposed to be Ted's toast. His past toasts were now legendary because of video posts by Punchy on the Internet. Another possible cause of the disaster might have been Barney trying to test his pick-up plays on unsuspecting women at the reception, while he lied about a series of telephone calls he made. And yet another possible cause might have been what Robin decided about telling or not telling Barney that she still had feelings for him. But Ted admits that the disaster was Marshall's doing. Lily had just learned that she was pregnant. Lily didn't want them to tell anybody until she reached the end of her first trimester, and as such she made Marshall drink all her drinks that evening. An extremely drunk Marshall was apt to do anything to cause a disaster. But perhaps it was an innocent misinterpreted finger point that caused the mess.","languages":"English","country":"USA","awards":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjIzMzYyMDkzOF5BMl5BanBnXkFtZTcwNjIxMDYzNg@@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"8.6/10"}],"metascore":"N/A","rating":"8.6","votes":"2518","imdbid":"tt1982341","seriesid":"tt0460649","type":"episode","response":"True"}