{"season":8,"name":"Homer's Enemy","year":"1997","rated":"TV-PG","released":null,"episode":23,"runtime":"30 min","genres":"Animation, Comedy","director":"Jim Reardon","writer":"Matt Groening (created by), James L. Brooks (developed by), Matt Groening (developed by), Sam Simon (developed by), John Swartzwelder","actors":"Dan Castellaneta, Julie Kavner, Nancy Cartwright, Yeardley Smith","plot":"Mr. Burns hires Frank Grimes (the human interest subject of Kent Brockman's report) as executive vice president at the Springfield Nuclear Power Plant. Grimes meets the employees and is immediately stunned at Homer's lackadasial work performance and his co-workers are nonchalant about it. Grimes - already annoyed by Homer's habits - becomes horrified when he observes Homer nearly drink a flask containing a toxic acid in absent-mindedness; however, Grimes is harshly reprimanded when he knocks the vial away and causes damage. Grimes tells Homer that they are \"enemies,\" but Homer - still wanting to be friends - invites \"Grimey\" over for dinner. However, the attempt only makes matters worse when Grimes sees that Homer is living in a nice home and has a family. Resolved to expose Homer as a fraud once and for all, he hands out a flyer announcing a \"design your own power plant\" contest, which has all references to this being a contest for elementary school students. However, Homer easily wins the contest, causing Grimes to go crazy. After running amok through the plant and mocking Homer, Grimes touches some electrical wires and is electrocuted. In the subplot, Bart wanders into public auction and submits the winning bid ($1) for an abandoned factory. Bart and Milhouse play around inside until the place crumbles.","languages":"English","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTQ2NzAzMDk4NV5BMl5BanBnXkFtZTgwMjk2MTMzMDE@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"9.2/10"}],"metascore":"N/A","rating":"9.2","votes":"1941","imdbid":"tt0701122","seriesid":"tt0096697","type":"episode","response":"True"}