{"season":7,"name":"The Slutty Pumpkin Returns","year":"2011","rated":"TV-14","released":null,"episode":8,"runtime":"22 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (created by), Craig Thomas (created by), Tami Sagher, Craig Gerard (story), Matthew Zinman (story), Daniel Gregor (story), Doug Mand (story)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"Ted, who came across the costume in a costume rental shop and discovered its rental records, finally tracks down the potential woman of his dreams that he met at a Halloween party ten years ago. He coined that woman the Slutty Pumpkin because of the costume. She is Naomi, and once Ted tracks her down, he finds that she is as beautiful as he remembers and she is as eager to hook up with him as he is with her. After ten years of anticipation however, Ted finds that something isn't quite right with their relationship, but he's willing to endure those problems after ten years of waiting. But one can only endure so much. How will Naomi feel if and when Ted tells her things aren't working? Meanwhile, Marshall and Lily are dreading receiving yet another \"used\" gift from Lily's grandparents - previous gifts which included things like a lawnmower - that they just can't use in their life in the city. What Lily's grandparents give them this time is another in that vein but slightly grander: their house in the suburbs as they are moving to Florida. Lily is excited about moving into the house so that they can raise their baby in the suburbs. Marshall doesn't want to move to the suburbs and he knows that Lily doesn't really want to move to the suburbs. Robin convinces Marshall that Lily currently has \"pregnancy brain\", a state in which Lily should not operate heavy machinery or make important decisions on their life. Marshall has to try and convince Lily that her current thoughts, including wanting to move into the house, aren't rational. And Robin finds out some news about Barney that she is more that happy to share with him: he's one-quarter Canadian on his father's side. Barney, who has always mocked Robin for being Canadian, resists his Canadian ancestry with all his might, but will the Canadian force be too much even for patriotic American Barney to handle?","languages":"English","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTc5MjUyMjgwMF5BMl5BanBnXkFtZTcwNTIwNjY5Ng@@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"7.5/10"}],"metascore":"N/A","rating":"7.5","votes":"1505","imdbid":"tt2072526","seriesid":"tt0460649","type":"episode","response":"True"}