{"season":5,"name":"Sons of the Harpy","year":"2015","rated":"TV-MA","released":null,"episode":4,"runtime":"51 min","genres":"Adventure, Drama, Fantasy","director":"Mark Mylod","writer":"George R.R. Martin (based on \"A Song of Ice and Fire\" by), David Benioff (created by), D.B. Weiss (created by), Dave Hill (written for television by)","actors":"Peter Dinklage, Nikolaj Coster-Waldau, Lena Headey, Emilia Clarke","plot":"Jorah Mormont steals a boat to navigate with his captive, Tyrion. Aboard a merchant ship, Jaime and Bronn sail to Dorne to rescue Myrcella. The Iron Bank is charging their loan and Cersei sends a representative of the Small Council to negotiate with the bankers. She then has a meeting with the High Sparrow and gives an army and power to his followers to neutralize the capital's sinners, including the patrons of Littlefinger's brothel, and Ser Loras Tyrell, the brother of Margaery. Tommen and his Kingsguard are stared down by the Faith Militant, and the king refuses to fight his way to the Tyrell knight. The disappointed Margaery leaves his side to stay with her family. Stannis Baratheon plans to head to Winterfell before the snow. Jon Snow is summoning nobles to help the Night's Watch with men and supplies and he has a dilemma with the name of the Bolton family. Melisandre tries to seduce Jon Snow, but he resists the temptation and does not break his vows. Shireen, restless at Castle Black, approaches her father and he informs her of what happened to her when she was a child. Sansa visits the tombs of her ancestors and Littlefinger tells a story of her family tells her that he will depart shortly to meet Cersei. He also advises her that the even the best men can be manipulated. In Dorne, Jaime and Bronn are found by a patrol and need to fight to survive. Ellaria Sand wants war but she is warned that Jaime Lannister and his mercenary accomplice are in her lands. Across the Narrow Sea, Daenerys has a meeting with Hizdahr zo Loraq, and she persists in her refusal to allow gladiatorial combat in Meereen. Tensions between Daenerys' government and the insurgent Sons of the Harpy culminate in the Harpies' ambushing of a party of Unsullied, and the only survivors are Grey Worm and the mortally wounded Ser Barristan Selmy.","languages":"N/A","country":"N/A","awards":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU4OTcwNDc2Nl5BMl5BanBnXkFtZTgwOTIwNTY0NTE@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"8.8/10"}],"metascore":"N/A","rating":"8.8","votes":"12874","imdbid":"tt3866838","seriesid":"tt0944947","type":"episode","response":"True"}