{"season":4,"name":"Three Days of Snow","year":"2009","rated":"TV-14","released":null,"episode":13,"runtime":"30 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (created by), Carter Bays (creator), Craig Thomas (created by), Craig Thomas (creator), Matt Kuhn, Joe Kelly (executive story editor), Robia Rashid (story editor)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"The storm of the century has hit New York in early 2009. The snowfall is supposed to last for three days, meaning that the city is at a virtual standstill for three days. Ted and Barney have made dates with two college girls - band mates - from out of town and are supposed to meet them at MacLaren's. Without each having the others' telephone numbers, Ted and Barney can only sit and wait to see if they show up. Without anyone else in the bar, Carl wants to close the bar early so that he can volunteer at a shelter, but Ted and Barney convince him to let them run the bar while he's gone. The start of their stint ends up being their dream as they've talked about buying a bar and never having last call. But as their dates show up, the night doesn't quite end up as they envisioned. Meanwhile, Marshall and Lily have a long set of rituals. Among them is that whenever one goes away out of town, he or she brings back a six pack from the visited city while the other meets him/her at the airport carrying a chauffeur's sign. Lily is scheduled to come back from a trip to Seattle, but she and Marshall have agreed that she will neither bring back a six pack on this trip and Marshall shouldn't meet her at the airport, as they've matured beyond such rituals. However Robin convinces Marshall that he should go meet Lily at the airport since she's certain Lily will buy the six-pack regardless of what she said. And the woman seated next to Lily on the plane convinces her that Marshall sounds like the kind of man who will come pick her up regardless of their agreement. Will one of Marshall and Lily ultimately be disappointed by the action of their spouse in this matter?","languages":"English","country":"USA","awards":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzgzMTI4OF5BMl5BanBnXkFtZTgwNzU4MDMyMjE@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"8.5/10"}],"metascore":"N/A","rating":"8.5","votes":"1749","imdbid":"tt1256174","seriesid":"tt0460649","type":"episode","response":"True"}