{"season":4,"name":"Woooo!","year":"2008","rated":"TV-14","released":null,"episode":8,"runtime":"22 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (created by), Carter Bays (creator), Craig Thomas (created by), Craig Thomas (creator), Carter Bays, Craig Thomas, Joe Kelly (executive story editor), Robia Rashid (story)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"Barney provides Ted with what both may consider the greatest opportunity in Ted's career. Barney is part of the search committee to hire the architectural firm to design Goliath National Bank's new headquarters, which would be a building integral to the Manhattan skyline. A Swedish architectural collective called Sven is currently being considered, but Barney has gotten Ted and his company at least the opportunity to make a pitch. Ted works hard to come up with what he believes is the perfect design, but it ultimately isn't chosen. What Ted doesn't know is Barney's role in the committee and why his design didn't come out on top. Meanwhile, Robin, single and jobless, wants to spend more quality girl's time with Lily. When Lily invites Robin to join her at her conservative colleague Jillian's birthday party, Lily and Robin are surprised that in her personal life, conservative Jillian is unfortunately what they call a \"woo\" girl, someone who always yells \"woo\" at the top of her lungs when anything remotely interesting happens to her. But when Robin decides to join Jillian's circle of \"woo\" friends, Lily also tries to become a \"woo\" girl herself, which doesn't fit into her general demeanor.","languages":"English","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTk4OTIzOTczOF5BMl5BanBnXkFtZTcwOTgwNDQwMg@@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"8.2/10"}],"metascore":"N/A","rating":"8.2","votes":"1494","imdbid":"tt1256190","seriesid":"tt0460649","type":"episode","response":"True"}