{"season":4,"name":"Old King Clancy","year":"2009","rated":"TV-14","released":null,"episode":18,"runtime":"30 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (created by), Carter Bays (creator), Craig Thomas (created by), Craig Thomas (creator), Jamie Rhonheimer, Joe Kelly (executive story editor), Robia Rashid (story editor)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"Ted enjoys the process of designing GNB's new headquarters, except for the negative comments Bilson is always hurling toward him. So Ted is relieved when a new executive committee without Bilson is overseeing the project for GNB. That relief turns to incredulity when Ted learns that in reality, the project in its entirety had been scrapped a month earlier. Ted eventually finds out that Marshall and Barney set up the charade of the new committee (with its fake GNB employees) to keep Ted happy for the couple of months that he was getting paid for work on the project anyway as per the contract. As this project was the only one he was working on for his architectural firm, Ted is afraid that he will be fired if they find out. Barney and Marshall think they've come up with a short term solution to Ted's problem, unless Bilson has his say. Meanwhile, Robin let's it slip that she once had the opportunity to have sex with a Canadian born celebrity with an unusual collection of memorabilia. The gang, but Lily in particular, try to figure out who that celebrity is, what he collected, and the Canadian termed sex act they almost performed. They guessing all three correctly is the only way Robin will make full disclosure.","languages":"English, Spanish","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTg2NDkwODAzOV5BMl5BanBnXkFtZTcwMzMxNDI0Mg@@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"7.8/10"}],"metascore":"N/A","rating":"7.8","votes":"1424","imdbid":"tt1256179","seriesid":"tt0460649","type":"episode","response":"True"}