{"season":8,"name":"The Itchy & Scratchy & Poochie Show","year":"1997","rated":"TV-PG","released":null,"episode":14,"runtime":"30 min","genres":"Animation, Comedy","director":"Steven Dean Moore","writer":"Matt Groening (created by), James L. Brooks (developed by), Matt Groening (developed by), Sam Simon (developed by), David X. Cohen","actors":"Dan Castellaneta, Julie Kavner, Nancy Cartwright, Yeardley Smith","plot":"Krusty becomes alarmed at the flagging ratings for \"The Itchy & Scratchy Show\" and demands it be corrected. The producers reason some new gimmicks are needed to inject fresh air and - after a focus group doesn't quite go as well as planned - decide to introduce a new character named Poochie, a rapping cartoon dog that is supposed to become friends with Itchy and Scratchy. Homer auditions to do Poochie's voice and wins the part. Poochie's first cartoon, \"The Beagle Has Landed,\" premieres to great fanfare but is poorly received to say the least. The producers decide that, given his spectacular failure, Poochie will be killed off in the mutt's next cartoon. Homer learns about this and at his next recording session, gives a speech imploring everyone to give Poochie a chance. However, the effort is unsuccessful and Poochie's death - along with the correct lines dubbed in - is revealed in the next animated short. Also: A college-aged boy named Roy temporarily moves in with the Simpsons and - in a nod to clichéd characters being used as a gimmick to entice viewership of waning TV shows - does everything to get in the way. Eventually, Roy announces he's moving out and moving in with a pair of sexy ladies.","languages":"English","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BYzQxMDE5MTEtYjZmOS00M2IyLWJhNjItMDJiZDZjNDA5NjIyXkEyXkFqcGdeQXVyNjQwNzY3OTQ@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"7.9/10"}],"metascore":"N/A","rating":"7.9","votes":"1020","imdbid":"tt0701245","seriesid":"tt0096697","type":"episode","response":"True"}