{"season":7,"name":"The Broath","year":"2012","rated":"TV-14","released":null,"episode":19,"runtime":"22 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (creator), Craig Thomas (creator), Carter Bays, Craig Thomas, Craig Gerard (story), Matthew Zinman (story), Daniel Gregor (story), Doug Mand (story)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"Before Barney's friends meet Quinn for the first time, Barney swears Ted to a broath (short for bro oath) that he won't tell them what Quinn does for a living. Concerned for Barney's welfare as he seems to be blinded by Quinn's manipulative ways, Ted quickly tells the others about her profession. However they are more concerned about that possible manipulation and want to judge Quinn on whether she is good for Barney. They quickly come to the conclusion after meeting her that she is continuing her manipulative ways. They are even more concerned when Barney tells them that Quinn and he are planning on living together. So, the gang decide to have one of their old fashioned interventions, or what Marshall has renamed for this special occasion a Quinntervention. Will Barney side with his longtime friends or his new love? Beyond what they feel about her, the one thing that homeless Ted and homeless Robin like is her rent controlled apartment which will be available once she moves in with Barney. The battle between Ted and Robin also highlights the uncomfortable state of their current relationship. And Lily is irked whenever Marshall has the need to tell a dirty sex story since everyone knows that he's talking about sex with her. Or is he always?","languages":"English","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMjE1MjMyMjg5NV5BMl5BanBnXkFtZTcwNzg2MzU1Nw@@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"8.7/10"}],"metascore":"N/A","rating":"8.7","votes":"1726","imdbid":"tt2265943","seriesid":"tt0460649","type":"episode","response":"True"}