{"season":1,"name":"The Pineapple Incident","year":"2005","rated":"TV-14","released":null,"episode":10,"runtime":"23 min","genres":"Comedy, Romance","director":"Pamela Fryman","writer":"Carter Bays (created by), Carter Bays (creator), Craig Thomas (created by), Craig Thomas (creator), Carter Bays, Craig Thomas, Kourtney Kang (executive story editor)","actors":"Josh Radnor, Jason Segel, Cobie Smulders, Neil Patrick Harris","plot":"In 2030, Ted admits to his kids that he doesn't remember all the stories from his past, with what he and Marshall call \"the pineapple incident\" being one of the more fuzzier ones. In late 2005, in the still short time their group of friends has included Robin, she is onto yet another guy (this time a multi-multi-millionaire) while Ted has barely had any women. Barney thinks it's because Ted over-analyzes every situation. So to lower Ted's inhibitions, Barney, Marshall and Lily think it would do Ted some good if he downed all five shots that Carl the bartender has concocted for them. To prove a point, Ted does down all five believing they will have no effect on him. But the next thing he remembers is the next morning waking up in his bed, with a sprained ankle, next to both a pineapple and a brunette woman whose face he can't see as she is face down on the pillow. Marshall, Lily and Barney are only able to fill in a part of the puzzle. As the four go on a quest to figure out the remainder of the puzzle (with Marshall fixating on the pineapple), the journey may start with the message on Ted's right arm. Ted believes that perhaps Robin, who was on a date with her multi-multi-millionaire boyfriend for the evening and who Ted called all evening in his drunken stupor, can also provide some information on what happened.","languages":"English","country":"USA","awards":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTk2MDc1MDExN15BMl5BanBnXkFtZTgwMzU3MDMyMjE@._V1_SX300.jpg","ratings":[{"Source":"Internet Movie Database","Value":"9.2/10"}],"metascore":"N/A","rating":"9.2","votes":"2772","imdbid":"tt0606115","seriesid":"tt0460649","type":"episode","response":"True"}